In [2]:
import pandas

df1 = pandas.DataFrame([[2,4,6],[10,20,30]]) #parse lists in list-object

df1

    0   1   2
0   2   4   6
1  10  20  30

In [3]:
# Create own column names
import pandas

df2 = pandas.DataFrame([[2,4,6],[10,20,30]], columns=["Price","Age","Value"])

df2

   Price  Age  Value
0      2    4      6
1     10   20     30

In [4]:
# Parse indexes
import pandas

df3 = pandas.DataFrame([[2,4,6],[10,20,30]], columns=["Students","Teachers","Parents"], index=["First","Second"])

df3

        Students  Teachers  Parents
First          2         4        6
Second        10        20       30

In [6]:
# Pandas with list of dictionaries and parse dic... 'Keys':'Values'
import pandas

s = pandas.DataFrame([{"Name":"Jones", "Age":"23"},{"Name":"Vivian", "Age":"21"}])
s

  Age    Name
0  23   Jones
1  21  Vivian

In [7]:
type(df1)

pandas.core.frame.DataFrame

In [10]:
df3

        Students  Teachers  Parents
First          2         4        6
Second        10        20       30

In [11]:
# Calculate 'mean'
df3.mean()

Students     6.0
Teachers    12.0
Parents     18.0
dtype: float64

In [12]:
type(df3.mean())

pandas.core.series.Series

In [14]:
df3.Students #student data-type is integer

First      2
Second    10
Name: Students, dtype: int64

In [21]:
# Open an external file
import pandas

ex = pandas.read_excel("Floor5EMARA.xlsx")
ex

,ROOMS,SECTION A,A,B,A.1,B.1
0,501,1 BDR Park Facing Apartment,682C7B401CEC,682C7B409D5C,Q2RD-8DCE-5DBN,Q2RD-ZDKJ-YW6S
1,503,1 BDR Park Facing Apartment,682C7B405AF5,682C7B409C26,Q2RD-6VEQ-TACU,Q2RD-6KL2-865G
2,504,1 BDR City Facing Apartment,682C7B4098B0,682C7B409999,Q2RD-9ZF7-TH5G,Q2RD-7UKF-3QUV
3,505,1 BDR Park Facing Apartment,682C7B4098AB,682C7B4027D1,Q2RD-AGV6-XEAC,Q2RD-6NZX-8G9U
4,506,1 BDR City Facing Apartment,682C7B409C1F,682C7B40A036,Q2RD-ACQ5-XH5N,Q2RD-A2EP-ST9H
5,507,1 BDR City Facing Apartment,682C7B405B2D,682C7B409B7E,Q2RD-AP8Y-B6J2,Q2RD-9V72-BZK3
6,508,1 BDR Courtyard Apartment,682C7B40283A,682C7B40986C,Q2RD-72AE-L98S,Q2RD-B6DD-8T4U